import React from "react";
import "./Blog.css";
const Blog = () => {
  return (
    <div>
      <BlogInfo
        heading="বিনোদন"
        title="বক্স অফিসে ঝড় তুলেছে যে কোরিয়ান ছবি"
        paragraph="২০১৭ সালে মুক্তি পায় কোরিয়ান অ্যাকশন ছবি ‘কনফিডেনশিয়াল অ্যাসাইনমেন্ট’। কিম সাং-হুন পরিচালিত ছবিটি মুক্তির দ্বিতীয় সপ্তাহেই বক্স অফিসের শীর্ষে উঠে যায়। মুক্তির দুই সপ্তাহের মধ্যেই বিক্রি হয়ে যায় ৯০ লাখ টিকিট। সে বছরের প্রথম ভাগে এটিই ছিল কোরিয়ায় সবচেয়ে বেশি দেখা সিনেমা—স্ট্রিমিং প্ল্যাটফর্মে দেখেছিলেন ৭৮ লাখ দর্শক। শুধু কোরিয়াই নয়, পরে বিশ্বব্যাপীই সমাদৃত হয়েছিল ‘কনফিডেনশিয়াল অ্যাসাইনমেন্ট’। চলতি মাসের ৭ তারিখ মুক্তি পেয়েছে ছবিটির সিকুয়েল ‘কনফিডেনশিয়াল অ্যাসাইনমেন্ট টু: ইন্টারন্যাশনাল’। "
        author={"Mehedy Rony Monju"}
      ></BlogInfo>
      <BlogInfo
        heading="বিনোদন"
        title="উচ্চতা যখন সমস্যা"
        paragraph="বেশ কয়েক মাস আগে সাত পাকে বাঁধা পড়েছেন অভিনেত্রী কারিশমা তান্না। এবার হতে চলেছে ডিজিটাল দুনিয়ার অভিষেক। তনুজা চন্দ্রার ক্রাইম থ্রিলার সিরিজ ‘হাস হাস’-এ গুরুত্বপূর্ণ চরিত্রে দেখা যাবে তাঁকে। একদিকে ডিজিটালে অভিষেক, অন্যদিকে নতুন সংসার। সব মিলিয়ে চমৎকার কাটছে দিন। সম্প্রতি এক সাক্ষাৎকারে নানা বিষয়ে কথা বলেছেন কারিশমা।
        চলতি বছরের ফেব্রুয়ারিতে বেশ ধুমধাম করে ব্যবসায়ী বরুণ ভানগেরা আর কারিশমার বিয়ে হয়েছে। প্রথম আলোর সঙ্গে সাক্ষাৎকারের শুরুতেই উঠে আসে তাঁর বিয়ের প্রসঙ্গ। কারিশমা বলেন, ‘আমার উচ্চতা ৫ ফুট ১১ ইঞ্চি। বোঝেনই তো, আমার উচ্চতার ছেলে পাওয়া কত মুশকিল। বিয়ের আশা প্রায় ছেড়েই দিয়েছিলাম। অবশেষে নিজের থেকে লম্বা ছেলে খুঁজে পেয়েছি। এক পার্টিতে বরুণের সঙ্গে দেখা হয়। সেদিন আমি হিল তোলা জুতা পরেছিলাম। তারপরও সে আমাকে ছাড়িয়ে গিয়েছিল।’ তাহলে কি প্রথম দর্শনেই প্রেম? "
        author={"Sujon Rahman Sumon"}
      ></BlogInfo>
    </div>
  );
};

const BlogInfo = (props) => {
  return (
    <div className="bloginfo">
      <h1> {props.heading}</h1>
      <h3>{props.title}</h3>
      <p>
        {props.paragraph} <i className="author">{props.author} </i>
      </p>
    </div>
  );
};
export default Blog;
